[{"Author":"JR","Title":"Web Developer or Web Designer","content":"\r\n                    <p>\r\n                        This has always been a topic of hot debate amound techs, making it a lil harder for \r\n                        newbies to decide early on in their coding learning journey what they would want to be.\r\n                        This prompted me to do some researches on this subject, and this article sumarise my thoughts.\r\n                    </p>\r\n                    <img id=\"freelance-media\" src=\"/images/design.png\">\r\n                <div class=\"container-fluid\">\r\n                    <div class=\"description row\">\r\n                        <div class=\"col-sm-5\">\r\n                            <div class=\"designer\">\r\n                                <h3 class=\"job-title\">A Designer's Job</h3>\r\n                                <img src=\"resources/images/design02.jpg\">\r\n                                    <p>\r\n                                        A web designer uses graphics and graphic design software to create a look for the web.\r\n                                        This design is then married with coding to bring it to life online.The designer may not always be the person writing the code.\r\n                                    </p>\r\n                                    <p>\r\n                                        Much of a designer's job is creative and uses both intuition and imagination, often characteristics of people who are considered right-brained.<br>\r\n                                        The best designers have a strong grasp on a variety of concepts including color and typography, spacial relationships, audience and user experience.\r\n                                    </p>\r\n                                \r\n                            </div>\r\n\r\n                        </div>\r\n                        <div class=\"col-sm-5 offset-sm-2\">\r\n                            <div class=\"developer\">\r\n                                <h3 class=\"job-title\">A Developer's Job</h3>\r\n                                <img src=\"resources/images/developer-skills01.jpg\">\r\n                                    <p>\r\n                                        A web developer builds the backbone of websites, typically from the ground up, and knows languages specific to the web.\r\n                                        HTML, Javascript, and CSS are among the tools in their kit.<br>\r\n                                        Skills from technical ability and thinking to logic are an essential part of succesful web developers repertoires.\r\n                                    </p>\r\n                                    <p>\r\n                                        While degrees in a variety of fields such as computer science or programming used to be required, a high demand in developers positions lead\r\n                                        employers to turn towards bootcamps that have the advantage of a solid <em>hands on</em> training over college institutions since \r\n                                        most employers will require a portfolio during the hiring process.\r\n                                    </p>\r\n                            </div>\r\n                        </div>\r\n                    </div>\r\n                </div>\r\n                <div class=\"designer-developer\">\r\n                    <h2 id=\"stack-title\">Full Stack Developer</h2>\r\n                    <div class=\"container-fluid\">\r\n                        <img id=\"stack-media\" src=\"/images/designer-developer.jpg\">\r\n                    </div>\r\n                    <h4 id=\"conclusion\">Two Jobs,Same Goals</h4>\r\n                        <p>\r\n                            At the end of the day, both web designers and web developers are working toward a singular goal - to create a website or app that entices and attracts users.<br>\r\n                            The defined lines between designers and developers are becoming more blurred as more designers are learning to code and more developers are paying close attention to design theory. \r\n                        </p>\r\n                        <p>\r\n                            One of the toughest parts about web design and development can be working together and communicating in a way that everyone understands.<br>\r\n                            All of these differences seem to imply that designers and developers are two very different jobs or roles, but it doesn't have to be the only option,<br>\r\n                            that's why i chose the <em>Full Stack Web Development</em> option at <a href=\"https://www.codecareeracademy.com/\" target=\"_blank\">Code Career Academy.</a>\r\n                            They are located in Lawrenceville GA, about 25 minutes from Downtown Atlanta GA. Jeff,the lead instructor is very knowleadgeable and his students success is Top priority.\r\n                        </p>\r\n                        <p id=\"cca\">\r\n                            Clik <a href=\"https://www.codecareeracademy.com/info/fall-full-time-immersive/\" target=\"_blank\">here</a> to learn more about their full stack programs,\r\n                            and if you sign up now, can take advantage of deep discounts and more.\r\n                        </p>\r\n                </div>","permalink":"freelance","id":5},{"Author":"JR","Title":"Browser Compatibility","content":"<p>\r\n                            In this article, i'll share my thoughts with you about a common \r\n                            problem a lot of developers face or should think about:\r\n                            how can we ensure that a website is compatible across as many browsers as possible?\r\n                        </p>\r\n                        <p>\r\n                            Each of us often have a preferred internet browser, that we naturally also like \r\n                            to use to preview websites or web applications in development.There are, however,\r\n                            a multitude of browsers (and many versions of those browsers), resulting in a variety of experiences for users. \r\n                        </p>\r\n                    <h2>Resetting the user agent stylesheet.. or CSS</h2>\r\n                        <p>\r\n                            All browsers have a default set of CSS rules that they apply to HTML.\r\n                            The default CSS rules live in a stylesheet or <em>user agent stylesheet</em> specific to the browser.\r\n                            Designing a website across browsers with different user agent stylesheets can be a frustrating experience. To avoid this problem,\r\n                            we can simply perform a <strong>css reset</strong> using the following steps.\r\n\r\n                        </p>\r\n                        <ol>\r\n                            <li>Create a <strong>reset.css</strong> file</li>\r\n                            <li>Copy and Paste CSS reset rules into our <strong>reset.css</strong> file</li>\r\n                            <li>Link to reset.css in the HTML file (make sure reset.css is loaded first before other CSS files, otherwise reset.css may reset your custom rules by accident).</li>\r\n\r\n                        </ol>\r\n                        <div class=\"bg-info text-white\">\r\n                            <pre>\r\n                                <code>\r\n                                    &lt;!DOCTYPE html&gt;\r\n                                    &lt;html lang=\"en\"&gt;\r\n                                    &lt;head&gt;\r\n                                        &lt;meta charset=\"UTF-8\"&gt;\r\n                                        &lt;meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\"&gt;\r\n                                        &lt;meta http-equiv=\"X-UA-Compatible\" content=\"ie=edge\"&gt;\r\n                                        &lt;title&gt;JR's First Blog&lt;/title&gt;\r\n                                        &lt;link rel=\"stylesheet\" href=\"reset.css&gt;\r\n                                        &lt;link rel=\"stylesheet\" href=\"styles.css\"&gt;\r\n                                    &lt;/head&gt;\r\n                                </code>\r\n                            </pre>\r\n                        </div>\r\n                        <p>A popular and free CSS reset can be found <a href=\"https://meyerweb.com/eric/tools/css/reset/\" target=\"_blank\">here</a></p>\r\n","permalink":"browser-compatibility","id":6}]